tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/mixingFluidizedBed/segregation2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .001;

pi  3.141529;
h   1000;
D   120;
depth 10;
R   #calc "$D/2";
nR  #calc "-$R";
r   #calc "$R/2";
nr  #calc "-$r";
xy  #calc "$R*sin($pi/4)";
nxy #calc "-$xy";

vertices
(
    ($nR 0  0)
    ($R  0  0)
    ($R  $h 0)
    ($nR $h 0)

    ($nR 0  $depth)
    ($R  0  $depth)
    ($R  $h $depth)
    ($nR $h $depth)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 560 1)
    simpleGrading
    (
        (
            
            1
        )
	    1                  // y-direction expansion ratio
        1                  // z-direction expansion ratio
    )
);

edges
(
);

patches
(
    patch inlet
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (2 3 7 6)
    )
    wall walls
    (
        (0 3 7 4)
        (1 2 6 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
