tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/mixingFluidizedBed/segregation2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 1;
        implicitPhasePressure yes;

        solver          GAMG;//PBiCGStab;
        preconditioner  DIC;
	smoother	DIC;
        tolerance       1e-12;
        relTol          0;
        minIter         5;
    }

    p_rgh
    {
        solver          PBiCGStab;//GAMG;
        smoother        DIC;
	preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;
        minIter         1;
    }

    "Theta.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    "(k|epsilon).*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
  nOuterCorrectors    20;
  nCorrectors         2;
  nNonOrthogonalCorrectors 0;
  faceMomentum yes;

    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance        1e-4;
            relTol              0;
        }

        alpha.air
        {
            tolerance  1e-4;
            relTol     0 ;
        }
        "Theta.*"
        {
            tolerance        1e-4;
            relTol              0;
        }

    }
}

relaxationFactors
{

    fields
    {
       p_rgh     0.3;

    }

    equations
    {
       "U.*"     0.5;
    }
}


// ************************************************************************* //
